Autodesk.Revit.DB.InstanceArray
An array that contains instances.

Autodesk.Revit.DB.InstanceArray.Insert(Autodesk.Revit.DB.Instance,System.Int32)
System.Int32
Insert the specified instance into the array.
item: The instance to be inserted into the array.
index: The instance will be inserted before this index.
Returns: Returns whether the instance was inserted into the array.

Autodesk.Revit.DB.InstanceArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.InstanceArray.ReverseIterator
Autodesk.Revit.DB.InstanceArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.InstanceArray.ForwardIterator
Autodesk.Revit.DB.InstanceArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.InstanceArray.Append(Autodesk.Revit.DB.Instance)
void
Add the instance to the end of the array.
item: The instance to be added.

Autodesk.Revit.DB.InstanceArray.Clear
void
Removes every instance from the array, rendering it empty.

Autodesk.Revit.DB.InstanceArray.Size
System.Int32
get
Returns the number of instances that are in the array.

Autodesk.Revit.DB.InstanceArray.Item(System.Int32)
System.Object
Gets or sets an instance at a specified index within the array.
index: The index of the instance to be set or retrieved.
Returns: Returns the instance at the specified index.

Autodesk.Revit.DB.InstanceArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.